# -*- mode: ruby -*-
# Homebrew
tap 'homebrew/dupes'

brew 'git'
brew 'curl'
brew 'tmux'
brew 'emacs'
brew 'openssl'
brew 'mackup'
brew 'ctags'
brew 'zsh'
brew 'grep --with-default-names'
brew 'rbenv --HEAD'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'sqlite'
brew 'the_silver_searcher'


# Cask
# --------------------
cask 'dropbox'
cask 'flash'
cask 'iterm2'
cask 'monotype-skyfonts'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'intellij-idea'

# Appstore & manual
# --------------------
#
# 1/ Chrome and Firefox 1password integration requires
#    them to be installed in /Applications directory
#
# dash, sunrise, chrome, firefox, pushpal, 1password, keynote, numbers, pages
