tap "d12frosted/emacs-plus"
tap "ejoffe/tap"
tap "graalvm/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jenkins-zh/jcli"
tap "microsoft/git"
tap "moncho/dry"
tap "railwaycat/emacsmacport"
tap "sscotth/monoid"
tap "varenc/ffmpeg-with-options"
tap "wagoodman/dive"
brew "openjdk"
brew "ant"
brew "apktool"
brew "gettext"
brew "readline"
brew "python@3.9"
brew "glib"
brew "atk"
brew "m4"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "openjdk@11"
brew "bazel"
brew "bettercap"
brew "bison"
brew "black"
brew "blueutil"
brew "coreutils"
brew "tmux"
brew "byobu"
brew "caddy"
brew "cliclick"
brew "cmake"
brew "cookiecutter"
brew "curl"
brew "diffutils"
brew "direnv"
brew "tcl-tk"
brew "python@3.8", link: false
brew "imagemagick"
brew "dmtx-utils"
brew "docker-machine"
brew "dpkg"
brew "expat"
brew "fd"
brew "gnutls"
brew "gobject-introspection"
brew "harfbuzz"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-subrepo"
brew "gnu-sed"
brew "go"
brew "grep"
brew "pango"
brew "grsync"
brew "hexyl"
brew "htop"
brew "hub"
brew "infer"
brew "ipython"
brew "jenv"
brew "jq"
brew "just"
brew "lftp"
brew "libgccjit"
brew "libpq"
brew "librsvg"
brew "libxmlsec1"
brew "mackup"
brew "make"
brew "mas"
brew "maven"
brew "ninja"
brew "meson"
brew "mitmproxy"
brew "mongosh"
brew "moreutils"
brew "mosh"
brew "nghttp2"
brew "nmap"
brew "node"
brew "node-build"
brew "node@14"
brew "nodenv"
brew "p7zip"
brew "pinentry-mac"
brew "pipx"
brew "pstree"
brew "ptpython"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "ruby@3.0"
brew "rust"
brew "semgrep"
brew "socat"
brew "sox"
brew "ssh-copy-id", link: true
brew "subversion"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tnftp"
brew "tor"
brew "torsocks"
brew "travis"
brew "tree"
brew "unison"
brew "unrar"
brew "vbindiff"
brew "wget"
brew "woff2"
brew "xmlstarlet"
brew "z"
brew "zlib"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp"], link: false
brew "ejoffe/tap/spr"
brew "heroku/brew/heroku"
brew "jenkins-zh/jcli/jcli"
brew "moncho/dry/dry"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-dbus", "with-glib", "with-imagemagick", "with-mac-metal", "with-rsvg"], link: false
brew "wagoodman/dive/dive"
cask "alfred"
cask "android-platform-tools"
cask "bartender"
cask "dash"
cask "dbeaver-community"
cask "diffmerge"
cask "evernote"
cask "font-3270"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-andada-pro"
cask "font-anka-coder"
cask "font-azeret-mono"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-caskaydia-cove-nerd-font"
cask "font-catamaran"
cask "font-dejavu-sans"
cask "font-encode-sans"
cask "font-encode-sans-condensed"
cask "font-encode-sans-expanded"
cask "font-encode-sans-sc"
cask "font-encode-sans-semi-condensed"
cask "font-encode-sans-semi-expanded"
cask "font-epilogue"
cask "font-exo"
cask "font-exo-2"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-gnu-unifont"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hahmlet"
cask "font-hasklig"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-inter"
cask "font-iosevka"
cask "font-iosevka-ss18"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-juliamono"
cask "font-lilex"
cask "font-luculent"
cask "font-manrope"
cask "font-maven-pro"
cask "font-maven-pro-vf-beta"
cask "font-monoid"
cask "font-monoid-nerd-font"
cask "font-montecarlo"
cask "font-mplus-nerd-font"
cask "font-outfit"
cask "font-profont-nerd-font"
cask "font-profontx"
cask "font-proggy-clean-tt-nerd-font"
cask "font-proza-libre"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-serif"
cask "font-roboto-slab"
cask "font-saira"
cask "font-saira-condensed"
cask "font-saira-extra-condensed"
cask "font-saira-semi-condensed"
cask "font-saira-stencil-one"
cask "font-scheherazade-new"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-source-sans-pro"
cask "font-space-grotesk"
cask "font-spleen"
cask "font-sudo"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "fontforge"
cask "gdisk"
cask "git-credential-manager-core"
cask "google-cloud-sdk"
cask "gpg-suite-pinentry"
cask "graalvm-ce-java11"
cask "graalvm-ce-java17"
cask "graalvm-ce-lts-java11"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2-nightly"
cask "jetbrains-toolbox"
cask "little-snitch"
cask "macfuse"
cask "mysql-shell"
cask "ngrok"
cask "now"
cask "osxfuse"
cask "p4v"
cask "secretive"
cask "sizeup"
cask "skim"
cask "skitch"
cask "skype"
cask "slack"
cask "spotify"
cask "temurin11"
cask "temurin8"
cask "the-unarchiver"
cask "tunnelblick"
cask "vagrant"
cask "veracrypt"
cask "virtualbox"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "Apple Configurator 2", id: 1037126344
mas "CurrentKey Stats", id: 1456226992
mas "GarageBand", id: 682658836
mas "Guidance", id: 412759995
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 736189492
mas "Pages", id: 409201541
mas "PhotoScape X", id: 929507092
mas "Reeder", id: 1449412482
mas "ToothFairy", id: 1191449274
mas "Wire", id: 931134707
mas "Xcode", id: 497799835
