# -*- mode: ruby -*-

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"

cask "java" unless system "/usr/libexec/java_home --failfast"

brew "autoconf"
brew "automake"
brew "python"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bettercap"
brew "coreutils"
brew "curl"
brew "findutils"
brew "fzf"
brew "gettext"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "go"
brew "grep"
brew "hexyl"
brew "htop"
brew "hub"
brew "imagemagick"
brew "ipython"
brew "jenv"
brew "jq"
brew "mackup"
brew "mas"
brew "maven"
brew "moreutils"
brew "mosh"
brew "p7zip"
brew "pstree"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "reattach-to-user-namespace"
brew "ssh-copy-id"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unison"
brew "unrar"
brew "vbindiff"
brew "wget"
brew "xmlstarlet"
brew "z"
brew "zlib"
brew "zsh"
brew "heroku/brew/heroku"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-natural-title-bar"]
# brew 'emacs', args: ['cocoa', 'srgb', 'with-gnutls']

cask "1password"
cask "1password-cli"
cask "adoptopenjdk8"
cask "alfred"
cask "avibrazil-rdm"
cask "bartender"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-drive-file-stream"
cask "dash"
cask "dropbox"
cask "evernote"
cask "intellij-idea"
cask "iterm2-nightly"
cask "karabiner-elements"
cask "little-snitch"
cask "ngrok"
cask "osxfuse"
cask "setapp"
cask "sizeup"
cask "skim"
cask "skitch"
cask "skype"
cask "slack"
cask "spotify"
cask "superhuman"
cask "the-unarchiver"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "wireshark"

