# -*- mode: ruby -*-

# args
cask_args appdir: "/Applications"

# taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'railwaycat/emacsmacport'

# casks
#cask 'google-chrome'
#cask 'dropbox'
#cask '1password'
#cask 'sourcetree'
cask 'java8'
cask 'emacs-mac'
cask 'spotify'
cask 'skitch'
cask 'skype'
cask 'iterm2-nightly'
cask 'skitch'
cask 'font-dejavu-sans'
cask 'font-inconsolata'
cask 'sizeup'
cask 'little-snitch'
cask 'bartender'
cask 'caffeine'
cask 'dash'
cask 'istat-menus'
cask 'the-unarchiver'
cask 'skim'
cask 'slack'
cask 'evernote'
cask 'osxfuse'
cask 'tunnelblick'
cask 'wireshark'

# vagrant & virtualbox
cask 'virtualbox'
#cask 'virtualbox4330101610'
cask 'vagrant'

# java..because
cask "java" unless system "/usr/libexec/java_home --failfast"
#cask 'java'
cask 'intellij-idea'
#cask "firefox", args: { appdir: "~/my-apps/Applications" }


# brews
brew 'mackup'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'grep'
brew 'pstree'
brew 'zsh'
brew 'git'
brew 'hub'
brew 'curl'
brew 'autoconf'
brew 'automake'
brew 'gawk'
brew 'openssl'
brew 'tree'
brew 'readline'
brew 'docker'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'reattach-to-user-namespace'
brew 'zlib'
brew 'tmux'
brew 'z'
brew 'gettext'
brew 'mackup'
brew 'python', args: ['--framework']
brew 'rbenv', args: ['--HEAD']
brew 'ruby-build'
brew 'gnu-sed', args: ['--with-default-names']
brew 'bash'
brew 'bash-completion'
brew 'wget', args: ['--with-iri']
brew 'p7zip'
brew 'ssh-copy-id'
brew 'emacs'
brew 'jq'
brew 'go', args: ['--with-cc-common']
brew 'unison'
brew 'xmlstarlet'
brew 'maven'
brew 'heroku-toolbelt'
brew 'jenv'
brew 'fzf'
brew 'ipython'
brew 'mosh'
brew 'terminal-notifier'
brew 'htop'
brew 'bat'
brew 'wget'
brew 'imagemagick'
# brew 'emacs', args: ['cocoa', 'srgb', 'with-gnutls']
